x1=[1 1 1 1 1 2 2 2 2 3 3 3 3 4 4 4 4 5 5 5 6 6 6 6 7 8 8 8 8 10 10 10 10 11 11 12 12 13 13 14 15 16 16 16 17 20]';%资历
x2=[1 0 1 0 0 1 0 0 0 0 1 1 1 0 1 0 0 0 0 1 0 1 0 1 1 0 1 1 0 0 0 1 1 1 0 0 1 0 1 0 1 1 0 0 0 0]';%管理非管理
xx3=[1 3 3 2 3 2 2 1 3 2 1 2 3 1 3 3 2 2 3 1 1 3 2 2 1 2 1 3 1 1 2 3 2 2 1 2 3 1 2 2 3 2 2 1 2 1]' ;%教育
x3=[1 0 0 0 0 0 0 1 0 0 1 0 0 1 0 0 0 0 0 1 1 0 0 0 1 0 1 0 1 1 0 0 0 0 1 0 0 1 0 0 0 0 0 1 0 1]';%1大学，0其他
x4=[0 0 0 1 0 1 1 0 0 1 0 1 0 0 0 0 1 1 0 0 0 0 1 1 0 1 0 0 0 0 1 0 1 1 0 1 0 0 1 1 0 1 1 0 1 0]';%1大学，0其他
x5=[2 5 6 3 5 4 3 1 5 3 2 4 6 1 6 5 3 3 5 2 1 6 3 4 2 3 2 6 1 1 3 6 4 4 1 3 6 1 4 3 6 4 3 1 3 1]';
y=[13876 11608 18701 11283 11767 20872 11772 10535 12195 12313 14975 21371 19800 11417 20263 13231 12884 13245 13677 15965 12366 21352 13839 22884 16978 14803 17404 22184 13548 14467 15942 23174 23780 25410 14861 16882 24170 15990 26330 17949 25685 27837 18838 17483 19207 19346]';
x0=ones(46,1);
%模型1-线性回归模型
% x=[x0 x1 x2 x3 x4];
% [b,bint,r,rint,stats]=regress(y,x,0.05);
% % b,stats                 %表2 模型1-计算结果
% subplot(3,1,1);
% rcoplot(r,rint)%模型1-残差图
% title('残差图')
% subplot(3,1,2);
% plot(x1,r,'r+');        %图1 模型1-残差与资历的关系
% title('残差与资历的关系')
% subplot(3,1,3);
% plot(x5,r,'b+');        %图2 模型1-残差与管理-教育组合的关系
% title('残差与管理教育组合的关系')
% %模型2-加入交互项
%  x=[x0 x1 x2 x3 x4 x2.*x3 x2.*x4];
% [b,bint,r,rint,stats]=regress(y,x,0.05);
% %  b,stats                %表4 模型2-计算结果
% subplot(3,1,1);
% rcoplot(r,rint) %模型2-残差图
% title('残差图')
% subplot(3,1,2);
% plot(x1,r,'r+');        %图3 模型2-残差与资历的关系
% title('残差与资历')
% subplot(3,1,3);
% plot(x5,r,'b+');        %图4 模型2-残差与管理-教育组合的关系
% title('残差与管理-教育组合的关系')
% 模型2改进-去除异常点
% x0(33)=[];
% x1(33)=[];
% x2(33)=[];
% x3(33)=[];
% x4(33)=[];
% x5(33)=[];
% y(33)=[];
% x=[x0 x1 x2 x3 x4 x2.*x3 x2.*x4];
% [b,bint,r,rint,stats]=regress(y,x,0.05);
% b,stats                    %表4 模型2-计算结果
% subplot(3,1,1);
% rcoplot(r,rint)            %模型2去除异常点-残差图        
% subplot(3,1,2);
% plot(x1,r,'r+');           %图5 模型2去除异常点-残差与资历的关系
% subplot(3,1,3);
% plot(x5,r,'b+');           %图6 模型2去除异常点-残差与管理-教育组合的关系
% %% 以下去除残差异常点后结果不理想，不需剔除异常点。
x0(22)=[]
x1(22)=[];
x2(22)=[];
x3(22)=[];
x4(22)=[];
x5(22)=[];
y(22)=[];
x0(33)=[];
x1(33)=[];
x2(33)=[];
x3(33)=[];
x4(33)=[];
x5(33)=[];
y(33)=[];
x0(40)=[];
x1(40)=[];
x2(40)=[];
x3(40)=[];
x4(40)=[];
x5(40)=[];
y(40)=[];
x=[x0 x1 x2 x3 x4 x2.*x3 x2.*x4];
[b,bint,r,rint,stats]=regress(y,x,0.05);
b,stats                    %表4 模型2-计算结果
subplot(3,1,1);
rcoplot(r,rint)            %模型2去除异常点-残差图        
subplot(3,1,2);
plot(x1,r,'r+');           %图5 模型2去除异常点-残差与资历的关系
subplot(3,1,3);
plot(x5,r,'b+');           %图6 模型2去除异常点-残差与管理-教育组合的关系